# BREWFILE


# --- formulae ---
brew 'bat'
brew 'ccls'
brew 'certbot'
brew 'coreutils'
brew 'cowsay'
brew 'diff-so-fancy'
brew 'eth-p/software/bat-extras'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fortune'
brew 'fzf'
brew 'gdb'
brew 'gh'
brew 'git'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'grep'
brew 'handbrake'
brew 'htop'
brew 'hyperfine'
brew 'imagemagick'
brew 'iproute2mac'
brew 'jq'
brew 'less'
brew 'lolcat'
brew 'node'
brew 'pacvim'
brew 'rbenv'
brew 'rename'
brew 'ripgrep'
brew 'shellcheck'
brew 'st'
brew 'telnet'
brew 'tldr'
brew 'tmux'
brew 'trash'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'youtube-dl'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# ---- casks ----
cask 'anki'
cask 'atom'
cask 'audacity'
cask 'bettertouchtool'
cask 'caffeine'
cask 'coconutbattery'
cask 'discord'
cask 'firefox'
cask 'flux'
cask 'gifski'
cask 'github'
cask 'google-chrome'
cask 'hammerspoon'
cask 'handbrake'
cask 'intellij-idea-ce'
cask 'keycastr'
cask 'magnet'
cask 'numi'
cask 'pycharm-ce'
cask 'r'
cask 'rstudio'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime'
cask 'texpad'
cask 'transmission'
cask 'vanilla'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
